用例文档分类：
	教务处老师
		1处理(输入、编辑、查看)整体框架策略
		2查看各院系教学计划及其统计
		3查看教师统计信息
		4查看课程统计信息
		5查看学生相关申请(准入、准出、毕业资格审核、留级退学资格审核统计等)   //这个我觉得可以删掉。。。
		18发布、修改、查看公共课程
	院系教务员
		6处理本院教学计划(输入)
		7处理课程信息(发布课程，指定教师，安排时间，修改课程部分信息，查看课程详细信息)
		8处理学生信息(录入、查看学生信息列表，查看每门课程的学生信息)
	任课老师
		9处理课程信息(填写课程信息，查看课程信息，查看课程统计信息)
		10处理学生信息(查看某课程的学生列表，登记成绩)
	辅导员
		11查看学生信息列表及其统计信息
		12查看课程信息
	学生
		13查看所有课程信息/课程统计信息
		14进行选课(查看可选课程，进行选课，补选，设定专业意向)
		15处理选课(查看已选课程，退选)
		16查看我的课程和课程信息(注销成绩)
		17查看个人信息(学分绩，学分获得进度)
		20学生业务申请(重修，准入准出)
	系统管理员
		19管理用户
反正我是把我认为应当在同一个界面系统里进行的功能操作全归纳为一个用例了，你们看看有哪些需要拆开的，那些需要合并的，总量限制在20个以内，咱们一人四五个。

分工：1-5、20 查燚斐 6-8 范二伦 9-12、18、19 包瑗珲 13-17 卑一佳