要补的东西：
	用例：
		用例20：学生的申请——查燚斐 完成
		修改：教务处老师处理学生申请(用例5)——查燚斐 完成
		用例21：学生的成绩注销、重修申请——查燚斐 完成
		修改有时限的用例的用例——查燚斐  完成
		修改用例1、用例6——查燚斐 完成
	测试用例：
		1，通用测试套件：10min不操作的——查燚斐 完成
		2，有时限的用例的测试用例补充
			框架，学生选课，教务处老师发布公选课，院系教务员录入学生信息，院系教务员提交教学计划(前置：框架已经提交)，学生退选(前置：开学两周内)，学生补选(前置：特定时间)，教师发布课程(前置：院系教务员发布课程)，学生提交申请(二专、第二专业、休学都应该是在开学)、学生设定专业意向(开学)——范佚伦
		3，修改后的用例5的测试用例——查燚斐
		4，根据卑二佳的功能性需求重新改测试用例(需求覆盖)——查燚斐 
		5，修改加入专业意向设定和跨专业选课的学生选课用例(用例14)和修改后的用例17的测试用例——范佚伦
		6，用例20测试用例——包瑗珲
		7，修改后的用例1、用例6的测试用例
	功能性需求：
		用例19、20的系统顺序图——包瑗珲
		用例19的功能性需求——卑一佳 完成
		用例20的功能性需求——卑一佳
		修改修改后的用例14、17的功能性需求——包瑗珲
		修改后的用例5的功能性需求——卑一佳	
		用19、20和修改后的教务处老师处理学生申请的用例修正度量文档——卑一佳

	需求规格文档：对外接口、界面 ——查燚斐
	会议记录——查燚斐 完成

注1：DDL 10.9 23：59：59
注2：参考使用的用例文档为群共享的10.8修改版用例