需求评审会议2[1008]会议记录

时间：10.08 17：00~18：00
地点：五食堂
参与者：团队全体成员

流程：
	1，讨论UI相关问题，确定了框架和教学计划的交互性形式
	2，进行了需求补全工作的分工
	3，安排了设计阶段的学习任务
附件：当前工作安排(DDL=10.9)
	要补的东西：
	用例：
		用例20：学生的申请——查燚斐
		修改：教务处老师处理学生申请——卑一佳
		用例21：学生的成绩注销、重修申请——查燚斐
		修改有时限的用例的用例——查燚斐
	测试用例：
		1，通用测试套件：10min不操作的——查燚斐
			 2，有时限的用例的测试用例补充
			框架，学生选课，教务处老师发布公选课，院系教务员录入学生信息，院系教务员提交教学计划(前置：框架已经提交)，学生退选(前置：开学两周内)，学生补选(前置：特定时间)，教师发布课程(前置：院系教务员发布课程)——范佚伦
		3，教务老师查看并处理学生申请的测试用例——查燚斐
		4，根据卑二佳的功能性需求重新改测试用例(需求覆盖)——查燚斐
	功能性需求：
		用例19、20、21的系统顺序图——包瑗珲
		用例19、20、21的功能性需求——卑一佳
		用例20、21的测试用例——包瑗挥
		教务处老师处理学生申请的修改用例的功能性需求——卑一佳	
		用19、20、21和修改后的教务处老师处理学生申请的用例修正度量文档——卑一佳
		

	需求规格文档：对外接口、界面 ——查燚斐
	会议记录——查燚斐